### AWS UAT App plan Part # 3
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  form"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["dist/favicon.ico"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "public-read"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "image/x-icon"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "dist/favicon.ico"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/dist/favicon.ico"%0A      + source_hash            = "15789dada2974fe2e62d763285aa97f0"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["dist/index.html"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "public-read"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "dist/index.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/dist/index.html"%0A      + source_hash            = "667402828aecd9b65eb15e99de172163"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0APlan: 40 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  ~ s3_bucket_object_etags       = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  ~ s3_bucket_object_ids         = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  ~ s3_bucket_object_keys_ids    = [%0A      + {%0A          + id  = (known after apply)%0A          + key = "build.zip"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/About-5325ddce.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/ArticleLayouts-d70ea114.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/Articles-af0b0e6e.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/Articles-cdca7afd.css"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/Landing-ad247451.css"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/Landing-ad66df16.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/PDF-19838165.css"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/PDF-5ddb6fa0.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/Start-92288b02.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/StartButtonFloat-41022946.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/StartButtonFloat-7308c767.css"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/Terminal-2e2ec67e.css"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/Terminal-b84267ff.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/azure_devicon_forest_green-ee780a3a.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/bash_devicon_forest_green-ab536553.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/d3_devicon_forest_green-b8696bec.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/devicons-4cbd2440.woff"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/devicons-880373aa.eot"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/devicons-cbb92633.ttf"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/devicons-d7c9f264.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/fontawesome-webfont-2adefcbc.woff2"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/fontawesome-webfont-7bfcab6d.eot"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/fontawesome-webfont-aa58f33f.ttf"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/fontawesome-webfont-ad615792.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/fontawesome-webfont-ba0c59de.woff"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/github_profile_pic-66b10136.jpg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/html2canvas.esm-0a33ed42.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/index-9a0f5c31.css"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/index-b7d43fd6.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/index.es-70f69c98.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/powershell_devicon_forest_green-f06a1fda.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/purify.es-3ef59d4c.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/recase-24e0a860.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/tableau_logo-ec7acb2d.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/terraform_devicon_forest_green-e7c4748a.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/ts_devicon_forest_green-0c5eea9d.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/assets/vue_devicon_forest_green-2e14a2aa.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/favicon.ico"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "dist/index.html"%0A        },%0A    ]%0A  ~ s3_bucket_object_version_ids = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*